{
    "username": "MichelleObama",
    "followers_count": 21723918,
    "statuses_count": 1924,
    "friends_count": 17,
    "favourites_count": 183,
    "description": "Girl from the South Side and former First Lady. Wife, mother, dog lover. Always hugger-in-chief. #IAmBecoming",
    "age": 0,
    "periodicity": 2702.0,
    "neg_count": 7,
    "pos_count": 61,
    "neutral_count": 7,
    "tweets_count": 75,
    "tweets": [
        {
            "text": "There’s nothing I love more than meeting with young people. Today, I had the chance to talk with some of the bright high school students from DC with @ReachHigher who shared their stories and plans for the future. I’m so proud of them and can't wait to follow their journeys. https://t.co/IfG65DrJ5x",
            "likes_count": 4187,
            "retweet_count": 433,
            "created_at": "05/19/2022, 22:31:11"
        },
        {
            "text": "I'm so proud of the talented players of @USWNT who worked tirelessly for years to advocate for the pay they deserve. I'm thinking of all the little girls everywhere who dare to dream and will see this team as an example of what's possible when you never give up. 👏🏾",
            "likes_count": 28633,
            "retweet_count": 2286,
            "created_at": "05/18/2022, 21:32:12"
        },
        {
            "text": "Today, I’ll be joining @PHAnews's virtual Food Equity Summit to take part in a discussion about our Pass the Love campaign and the work we can do together to increase access to healthy and affordable food for all. Tune in now! https://t.co/lO1ycqyFBn",
            "likes_count": 1201,
            "retweet_count": 236,
            "created_at": "05/18/2022, 17:58:52"
        },
        {
            "text": "I’m so excited about the Voyager Scholarship! We're teaming up with @bchesky to support young leaders who are eager to make their mark, but might not have the same opportunities as others. If you're a rising college junior in the U.S., apply right now: https://t.co/nez2BKmAnB https://t.co/WTG0kIsUix",
            "likes_count": 2439,
            "retweet_count": 417,
            "created_at": "05/16/2022, 13:47:39"
        },
        {
            "text": "So when you get home from marching, check your voter registration status with @WhenWeAllVote and encourage others to do the same at https://t.co/PA4LvmFR0D.",
            "likes_count": 6452,
            "retweet_count": 1540,
            "created_at": "05/14/2022, 17:07:01"
        },
        {
            "text": "If any of you are questioning whether or not your vote matters, I get it. But remember that state lawmakers are the ones who will determine whether abortion is safe, legal, and accessible in your communities. And we are the ones who determine our state lawmakers. https://t.co/Nafi5LfC8i",
            "likes_count": 8361,
            "retweet_count": 1622,
            "created_at": "05/14/2022, 17:07:01"
        },
        {
            "text": "But we don’t have to stand idly by while others try to turn back the clock on progress. I’m so inspired by everyone out marching today. And I know that we’re going to see so many folks carrying this energy forward to the elections in November and in every election after that.",
            "likes_count": 9908,
            "retweet_count": 907,
            "created_at": "05/14/2022, 17:07:00"
        },
        {
            "text": "It’s been a tough couple of weeks since we saw the leaked SCOTUS draft opinion on abortion. Even if we knew the courts were heading toward this day, it doesn’t make the frustration, grief, and fear any less real.",
            "likes_count": 47795,
            "retweet_count": 4591,
            "created_at": "05/14/2022, 17:06:59"
        },
        {
            "text": "Decades before our family lived there, First Lady Eleanor Roosevelt planted a Victory Garden on the White House lawn—and I'm thrilled to share that the Fruit &amp; Vegetable Garden at the Obama Presidential Center will be named in her honor. I can’t wait for you all to visit! https://t.co/wAMwaAHn18",
            "likes_count": 18408,
            "retweet_count": 1643,
            "created_at": "05/11/2022, 12:00:49"
        },
        {
            "text": "Happy #MothersDay! I'm so thankful for the love, guidance, and care that my mom has instilled in me. I’ve shared so much of her wisdom with my own daughters over the years. ❤️ https://t.co/EjFxs4R9by",
            "likes_count": 78375,
            "retweet_count": 3222,
            "created_at": "05/08/2022, 15:47:19"
        },
        {
            "text": "This year for #CollegeSigningDay, I’m wearing a college shirt from @UMBC, an Asian American and Native American Pacific Islander Serving Institution in Baltimore County, MD. \n\nStudents, I want to hear from you! Share your plans for the future using #CollegeSigningDay! 🎉 https://t.co/XyiwxMGUOb",
            "likes_count": 10920,
            "retweet_count": 1193,
            "created_at": "05/07/2022, 16:56:44"
        },
        {
            "text": "Happy College Signing Day! 🎓🥳👏🏾\n\nToday, we celebrate everyone making a commitment to get their education at a community college, university, trade school, or the military.\n\nI hope you’ll share your plans with @BetterMakeRoom and me using #CollegeSigningDay! https://t.co/dMQlvb2IcF",
            "likes_count": 2702,
            "retweet_count": 477,
            "created_at": "05/07/2022, 15:00:57"
        },
        {
            "text": "From an early age, my mom, Marian Robinson, taught me how to think for myself, use my own voice, and understand my own worth.\n\nAhead of #MothersDay, I’m proud to announce that the “Opening the White House” exhibit at the Obama Presidential Center will be named after her. 💕 https://t.co/QDhSSRRet0",
            "likes_count": 20141,
            "retweet_count": 2036,
            "created_at": "05/06/2022, 13:33:20"
        },
        {
            "text": "I’d love to hear about a remarkable teacher in your life. Share how they contributed to who you are today and how you are celebrating them during #TeacherAppreciationWeek.",
            "likes_count": 1259,
            "retweet_count": 179,
            "created_at": "05/04/2022, 20:05:46"
        },
        {
            "text": "This Teacher Appreciation Week, I wanted to tell you about a teacher in California – Ms. Tsung. She's been using the interactive resources from our Pass the Love campaign with @PHAnews to teach her 6th graders about food equity! #ThankATeacher https://t.co/kfstqoyrjd",
            "likes_count": 4187,
            "retweet_count": 464,
            "created_at": "05/04/2022, 20:05:46"
        },
        {
            "text": ".@smalonemd and I also spoke about women's health, aging, and menopause not too long ago on The Michelle Obama Podcast from our @HGMedia. Take a listen: https://t.co/uuDfHVeGGd",
            "likes_count": 1242,
            "retweet_count": 198,
            "created_at": "04/29/2022, 20:46:41"
        },
        {
            "text": "As women, we need to have more open and honest conversations about our bodies – especially as we get older. Here's an important piece about the research and reforms needed to support those experiencing menopause.\nhttps://t.co/Ibxdu5em2X",
            "likes_count": 5441,
            "retweet_count": 785,
            "created_at": "04/29/2022, 20:46:40"
        },
        {
            "text": "The South Side made my brother Craig and me who we are today, so it was extra special seeing him go back to participate in our @ObamaFoundation Futures Series. By sharing his story, he’s letting these young people know that they can also dream big and accomplish their goals. https://t.co/arvuPVBnW0",
            "likes_count": 3581,
            "retweet_count": 372,
            "created_at": "04/29/2022, 17:31:22"
        },
        {
            "text": "Whether you're going to a community college, a university, or joining the military, tell me where you're headed using #CollegeSigningDay! 🎓🎉",
            "likes_count": 1342,
            "retweet_count": 153,
            "created_at": "04/28/2022, 21:48:49"
        },
        {
            "text": "College Signing Day is one of my favorite events of the year, and I can’t wait to celebrate it virtually with @ReachHigher on May 7! https://t.co/mDZoP5yEvQ",
            "likes_count": 2205,
            "retweet_count": 320,
            "created_at": "04/28/2022, 21:48:49"
        },
        {
            "text": "Happy birthday, @CraigMalRob! I couldn't have asked for a better brother and friend. Here's to celebrating 60! ❤️ https://t.co/DbDxYqItxa",
            "likes_count": 33997,
            "retweet_count": 1004,
            "created_at": "04/22/2022, 00:03:07"
        },
        {
            "text": "We need to talk about the state of our democracy and the ways we can protect it right from our own communities. \n\nI'll be speaking more on this at @WhenWeAllVote's #CultureOfDemocracy Summit, and I hope you'll join us from June 10-13: https://t.co/Ce0cZImX6R https://t.co/nLWlUHNsav",
            "likes_count": 3103,
            "retweet_count": 655,
            "created_at": "04/20/2022, 16:34:50"
        },
        {
            "text": "And even though we’ve reached our goal – our work isn’t done. Let’s keep working until every family, in every zip code, has access to healthy food. Learn more about our Pass the Love campaign with @PHAnews at https://t.co/s0WCBvE8HK. 🥕🍅🥦🥔 https://t.co/Kxhp96zQaB",
            "likes_count": 1110,
            "retweet_count": 149,
            "created_at": "04/19/2022, 20:01:52"
        },
        {
            "text": "Thanks to the support of so many people like you who either donated, volunteered, or helped distribute meals – we’ve helped provide meal kits to families in Atlanta, Cleveland, Detroit, Fresno, and Philadelphia. https://t.co/iAYkdip3Jg",
            "likes_count": 1444,
            "retweet_count": 179,
            "created_at": "04/19/2022, 20:01:50"
        },
        {
            "text": "Last spring, we launched our Pass the Love campaign with @PHAnews with the goal of distributing one million healthy meal kits to families in need.\n\nI’m excited to share that we’ve not only met our goal, but surpassed it! 💕 https://t.co/tnSoylDxSY",
            "likes_count": 2727,
            "retweet_count": 398,
            "created_at": "04/19/2022, 20:01:48"
        },
        {
            "text": "I’m so excited for this group of Asia-Pacific Leaders to come together, share their ideas, and develop new skills to create even more change this year. Welcome—I can’t wait to follow your journeys! https://t.co/fEBCrNe26g",
            "likes_count": 1951,
            "retweet_count": 280,
            "created_at": "04/19/2022, 18:48:35"
        },
        {
            "text": "Every Easter, I am reminded of the power of faith and community. Wishing all those celebrating today a day of joy and renewal. https://t.co/LMFKUktBxD",
            "likes_count": 83642,
            "retweet_count": 4826,
            "created_at": "04/17/2022, 14:30:21"
        },
        {
            "text": "Happy #NationalGardeningDay! 🥦🥕🍎\n\nAt just 6-years-old, Kendall is already inspiring people of all ages with her love of farming as Georgia’s youngest certified farmer.\n\nHer story is a reminder that you're never too young or old to get started. Share your garden photos with me! https://t.co/RFgF9hUZHk",
            "likes_count": 5871,
            "retweet_count": 651,
            "created_at": "04/14/2022, 14:37:12"
        },
        {
            "text": "Whether you’re visiting a national park or taking a walk around your neighborhood, there’s so much out there to explore.\n\nWe hope the show inspires you to take a trip outdoors. If you do, be sure to take part in the #WildForAll Challenge at https://t.co/sjecUm3hHF. Happy trails! https://t.co/h1kAy5Sphl",
            "likes_count": 4004,
            "retweet_count": 405,
            "created_at": "04/13/2022, 19:59:48"
        },
        {
            "text": "Over the years, @BarackObama and I have been lucky enough to show our girls some of the magic of our world’s natural wonders. \n\nThis time, Barack wants you to join in on the fun with his new @HGMedia show, Our Great National Parks, which is streaming now on Netflix. 🌍 https://t.co/tBkX5AqFSX",
            "likes_count": 40101,
            "retweet_count": 2730,
            "created_at": "04/13/2022, 19:59:42"
        },
        {
            "text": "Happy #NationalPetDay, Sunny! I just love spending time with my furry gal—whose snuggles bring so much joy and delight to everyone she meets. ❤️🐾 https://t.co/tmQJkv0m2j",
            "likes_count": 26036,
            "retweet_count": 993,
            "created_at": "04/11/2022, 20:30:35"
        },
        {
            "text": "While in Chicago, Barack attended a @ChicagoBulls game with students from the @GirlsAlliance and @MBK_Alliance. \n\nThese young people are so hard working and bright—and they deserved this night of fun! https://t.co/TGvb9zLK6A",
            "likes_count": 15440,
            "retweet_count": 1099,
            "created_at": "04/08/2022, 16:15:36"
        },
        {
            "text": "I was so moved to see Justice Ketanji Brown Jackson confirmed this afternoon. Like so many of you, I can’t help but feel a sense of pride—a sense of joy—to know that this deserving, accomplished Black woman will be a part of the highest court in the land. https://t.co/hnPcDuPt8w",
            "likes_count": 234443,
            "retweet_count": 23518,
            "created_at": "04/07/2022, 19:52:04"
        },
        {
            "text": "In her book, she uses the lens of the 2020 movement for racial justice to explore its impact on the Black experience—the joy, the fear, the frustration. It is powerful, poignant, and deeply moving. I hope you’ll check it out. https://t.co/2UNjkvebvG",
            "likes_count": 1896,
            "retweet_count": 321,
            "created_at": "04/05/2022, 21:05:11"
        },
        {
            "text": "Here's to you, @ProfessorEA! Not only is she an exceptional author and educator, she is also a trusted friend—one whose insights have challenged me to see the world in new and different ways. I’m excited to share that her latest book, “The Trayvon Generation,” is available now. https://t.co/f5hEvP0QLo",
            "likes_count": 3550,
            "retweet_count": 474,
            "created_at": "04/05/2022, 21:05:10"
        },
        {
            "text": "Antilynching legislation was first introduced over a century ago—and failed to pass over 200 times. Now, the Emmett Till Antilynching Act is a chance to reckon with our history, and move in a new direction—one that makes this country safer and more just for us all.",
            "likes_count": 7033,
            "retweet_count": 759,
            "created_at": "03/30/2022, 20:02:54"
        },
        {
            "text": "Yesterday, President Biden signed the Emmett Till Antilynching Act into law—finally designating lynching as a federal hate crime in the United States. For many Black folks, this historic moment comes with a lot of different emotions—I know it does for me.",
            "likes_count": 33773,
            "retweet_count": 3065,
            "created_at": "03/30/2022, 20:02:54"
        },
        {
            "text": "Congratulations, @Questlove and the team at @SummerOfSoul, for your #Oscar win! Barack and I were so moved by this celebration of Black music, culture, and joy. What you did in telling this overlooked story is so important—and we are grateful for artists like you leading the way!",
            "likes_count": 63783,
            "retweet_count": 4214,
            "created_at": "03/28/2022, 21:30:37"
        },
        {
            "text": "This #WomensHistoryMonth, I am thinking about the next generation of girls who are working to make our world a better place—like these talented young women I met in Hawai’i with the @GirlsAlliance. I know you'll be as inspired by their stories as I am. https://t.co/vG1ETqKSpp",
            "likes_count": 4290,
            "retweet_count": 652,
            "created_at": "03/25/2022, 16:00:12"
        },
        {
            "text": "Now, kids everywhere will get to hear some of our favorites through his Little Craig Series with @Vooks. I hope you’ll check out the first book in his series—Little Craig: Balloons and Cake and many other fun stories here: https://t.co/QInO7PO4J7 https://t.co/o03gLOYzae",
            "likes_count": 3092,
            "retweet_count": 315,
            "created_at": "03/24/2022, 17:31:32"
        },
        {
            "text": "Growing up, my brother @CraigMalRob was my world. He was my fiercest hallway-race competitor, my protector, my back-up singer. And over the years, he’s collected some great stories about the lessons he learned along the way. ❤️",
            "likes_count": 6252,
            "retweet_count": 429,
            "created_at": "03/24/2022, 17:31:18"
        },
        {
            "text": "Congrats to @NPSI_Believe's 2022 Power of Hope Award winners! I am grateful for the work these school counselors, teachers, and administrators have done to ensure their students have the skills and support systems they need to pursue their dreams and prepare for the future. 🎓👏🏾 https://t.co/8cEI2FuARi",
            "likes_count": 1314,
            "retweet_count": 219,
            "created_at": "03/17/2022, 18:02:09"
        },
        {
            "text": "Happy #InternationalWomensDay! \n\nToday, I hope you’ll join the @GirlsAlliance to help empower the next generation of women—because when girls get the support and opportunities they deserve, it creates a better world for all of us.\n\nTake action: https://t.co/uAJh9LbSW0 https://t.co/LAdpid42Yh",
            "likes_count": 3727,
            "retweet_count": 644,
            "created_at": "03/08/2022, 22:34:14"
        },
        {
            "text": "I know many of us are wondering how we can help as we continue to hear the news about Ukraine. The @ObamaFoundation has compiled a list of organizations you can support if you're thinking about what you can do to make a difference right now. https://t.co/BICGpNCSgq",
            "likes_count": 9223,
            "retweet_count": 2171,
            "created_at": "03/03/2022, 22:08:03"
        },
        {
            "text": "What a performance! @Nandi_Bushell, I can’t wait to see where your talents take you! 👏🏾 https://t.co/BpVv6mXKJL",
            "likes_count": 29214,
            "retweet_count": 2734,
            "created_at": "02/22/2022, 20:01:37"
        },
        {
            "text": "As we celebrate the remarkable life of Congressman John Lewis, let us recommit ourselves to securing and protecting our right to vote. Join me in honoring his life's work by getting involved with @WhenWeAllVote: https://t.co/Lus9IFx3fv https://t.co/H35LQf1bi8",
            "likes_count": 14112,
            "retweet_count": 1893,
            "created_at": "02/21/2022, 15:31:22"
        },
        {
            "text": "I’m so proud of the young women I met in Hawaiʻi. \n\nThey’re teaching their peers about mental health, tutoring classmates in coding, and educating their community about the criminal justice system. \n\nFor them, this is just the beginning. I can’t wait to see what they do next. 💕 https://t.co/xmTk0eQe4Z",
            "likes_count": 10641,
            "retweet_count": 840,
            "created_at": "02/16/2022, 17:02:47"
        },
        {
            "text": "Congrats on winning gold, @ErinJackson480! Your accomplishments on the ice are just as impressive as the humility and hard work you’ve demonstrated behind the scenes. I can’t wait to see what you do next. 🤩 https://t.co/AChDZEYrvn",
            "likes_count": 7203,
            "retweet_count": 675,
            "created_at": "02/15/2022, 16:31:22"
        },
        {
            "text": "I feel so blessed to be able to spend every day with this guy. Happy Valentine's Day, Barack! Here's to all the adventures we have ahead. ❤️ https://t.co/NIYxkO900k",
            "likes_count": 165926,
            "retweet_count": 5932,
            "created_at": "02/14/2022, 18:15:46"
        },
        {
            "text": "That day made me think: this could actually work. We could actually do this. \n\nAnd thanks to all of you, that’s exactly what we did. \n\nDo you remember that day, or were you involved in the campaign in any way? I would love to hear your story. Use #Obama08 to share your memories.",
            "likes_count": 7559,
            "retweet_count": 524,
            "created_at": "02/10/2022, 14:30:48"
        },
        {
            "text": "Fifteen years ago, Barack announced his candidacy in Springfield. It was bitter cold, but as far as my eyes could see, there were people everywhere. People from all over the state, from different backgrounds and identities—all who believed in his promise. All who believed in us. https://t.co/3n0YkeJGFH",
            "likes_count": 52826,
            "retweet_count": 3599,
            "created_at": "02/10/2022, 14:30:47"
        },
        {
            "text": "Happy National School Counseling Week to all of the incredible school counselors who selflessly support our students each and every day! Thank you for all that you do to empower our nation’s young people. Congrats to the 2022 School Counselor of the Year, Alma Lopez! #NSCW22 🎉 https://t.co/pQvmVIOa97",
            "likes_count": 7194,
            "retweet_count": 1217,
            "created_at": "02/08/2022, 18:00:16"
        },
        {
            "text": "When we work together, we can change the culture around voting and fight voter suppression.\n\nThat's why I’m bringing together some friends in the fight for our vote with @WhenWeAllVote. I hope you’ll join us!\n\nText “join” to 56005 to get involved. https://t.co/CycbWGydVY",
            "likes_count": 5945,
            "retweet_count": 1455,
            "created_at": "01/31/2022, 17:00:38"
        },
        {
            "text": "Nine years ago, we lost Hadiya Pendleton to the tragedy of gun violence. I know her loss is still devastating for so many. That’s why Barack and I hope that the Hadiya Pendleton Winter Garden at the Obama Presidential Center can share her light with the world. See how here: https://t.co/wKlSImpc3I",
            "likes_count": 10480,
            "retweet_count": 1867,
            "created_at": "01/28/2022, 14:17:21"
        },
        {
            "text": "Ada Twist, Scientist, and her friends are back for Season 2! I'm so excited for families everywhere to watch their latest adventures as they try new experiments and learn new skills. Watch now on @Netflix! 👩🏾‍🔬🔬🧪 https://t.co/ZtLDcdLiYE",
            "likes_count": 6647,
            "retweet_count": 902,
            "created_at": "01/26/2022, 14:30:08"
        },
        {
            "text": "Today is International #EducationDay! 🌎\n\nI hope you’ll take some time today to support @GirlsAlliance’s work to empower girls around the world—and learn how young women like Judith are inspiring girls to learn in their communities. \n \nJoin us: https://t.co/uAJh9LbSW0 https://t.co/lbyoBQ6spS",
            "likes_count": 3504,
            "retweet_count": 682,
            "created_at": "01/24/2022, 17:35:35"
        },
        {
            "text": "Dr. Biden is one of the most passionate, joyful, and hardworking people I know. She’s done a wonderful job making the role of @FLOTUS her own—working to support military families, promote cancer research, and support educators throughout this pandemic. I’m so proud of her! ❤️ https://t.co/55B0bfUeQ0",
            "likes_count": 10064,
            "retweet_count": 907,
            "created_at": "01/21/2022, 00:00:29"
        },
        {
            "text": "When Barack and I left the White House, we asked you to help us shape the @ObamaFoundation's work. Since then, we’ve launched nine programs and connected countless leaders around the world. This is just the beginning, and we can’t wait for what's next. https://t.co/PrGkDTRbP3 https://t.co/gGX9zX8tIf",
            "likes_count": 5795,
            "retweet_count": 630,
            "created_at": "01/20/2022, 22:33:37"
        },
        {
            "text": "André Leon Talley was a one-of-a-kind presence who changed the face of fashion and beauty for a generation of girls just like me. He will be missed, but I know his legacy will continue inspiring people for years to come. https://t.co/onAgu005go",
            "likes_count": 16778,
            "retweet_count": 1122,
            "created_at": "01/20/2022, 03:45:23"
        },
        {
            "text": "I’m so excited to welcome the newest cohort of @ObamaFoundation Europe Leaders. Looking forward to learning more about your work and seeing the progress you make this year! 🌍 https://t.co/YPHJbTSDYO",
            "likes_count": 2597,
            "retweet_count": 336,
            "created_at": "01/18/2022, 22:30:28"
        },
        {
            "text": "Here’s to a sweet 58th! Thank you so much for your outpouring of love. Whether you texted, emailed, or posted on social media, every birthday message I received today meant a lot to me. Looking forward to seeing what this upcoming year has in store. 💕 https://t.co/owA4Qidqwk",
            "likes_count": 286204,
            "retweet_count": 16073,
            "created_at": "01/17/2022, 22:02:34"
        },
        {
            "text": "I hope you’ll tune in tonight at 7pm ET on @BET to see Yara Shahidi and I speak with some talented young people who are owning their stories and becoming who they want to be. #BecomingOnBET 💕 https://t.co/0TtKF0PYwP",
            "likes_count": 6856,
            "retweet_count": 745,
            "created_at": "01/17/2022, 19:03:12"
        },
        {
            "text": "One of the best ways to honor Dr. King's legacy is to take action to help protect voting rights in our country. Text ‘MLK’ to 56005 and @WhenWeAllVote will send some details you can use to call elected officials today and urge them to pass the Freedom to Vote: John R. Lewis Act. https://t.co/oo69J8KedQ",
            "likes_count": 9757,
            "retweet_count": 2437,
            "created_at": "01/17/2022, 15:16:07"
        },
        {
            "text": "One of my favorite parts about writing Becoming and sharing my story has been seeing how it relates to so many of yours. \n\nI recently spoke with a group of college students about the power of owning your unique story. I hope you’ll watch on @BET this Monday, 1/17 at 7pm ET. https://t.co/bBEAuUkKaE",
            "likes_count": 4644,
            "retweet_count": 591,
            "created_at": "01/14/2022, 23:33:24"
        },
        {
            "text": "What a fitting tribute to have Dr. Maya Angelou become the first Black woman on the U.S. quarter—she was a phenomenal woman whose comfort in her own skin made so many of us feel seen in ours. https://t.co/fBiICFWYUu",
            "likes_count": 24119,
            "retweet_count": 2552,
            "created_at": "01/12/2022, 21:45:15"
        },
        {
            "text": "I'm thrilled to share that we'll soon be distributing healthy meal kits to families in Fresno as part of our Pass the Love campaign with @PHAnews! \n\nWe're so close to reaching our goal of providing one million meals, but we need your support. \n\nJoin us: https://t.co/s0WCBvE8HK https://t.co/5fybhnPGPE",
            "likes_count": 4554,
            "retweet_count": 780,
            "created_at": "01/11/2022, 17:00:56"
        },
        {
            "text": "To all the teachers and school counselors out there—thank you for everything you do. The love and support you give to your students day in and day out could not be more important, especially in times like these. I’m proud to join @ReachHigher and @CFPExtraYard in celebrating you! https://t.co/epXt8v2PED",
            "likes_count": 6576,
            "retweet_count": 885,
            "created_at": "01/10/2022, 19:35:52"
        },
        {
            "text": "Let's make sure that every voice is heard and every vote is counted in the 2022 midterm elections and beyond.\n\nTake the pledge: https://t.co/Lus9IFx3fv.",
            "likes_count": 5583,
            "retweet_count": 1511,
            "created_at": "01/09/2022, 14:49:15"
        },
        {
            "text": "In 2020, millions made their voices heard at the polls. But now, folks who oppose that progress are making it harder to vote. That’s why I’m asking you to join @WhenWeAllVote and 30 other organizations to turn out more voters and urge Congress to pass voting rights legislation. https://t.co/hwgyyuTGy9",
            "likes_count": 19769,
            "retweet_count": 5424,
            "created_at": "01/09/2022, 14:49:14"
        },
        {
            "text": "So glad you were able to watch! 😊 Don't forget to tell your friends and family to register to vote with @WhenWeAllVote at https://t.co/LqTAmvFQzX. https://t.co/ddxn9pIQFK",
            "likes_count": 5933,
            "retweet_count": 697,
            "created_at": "01/05/2022, 03:00:00"
        },
        {
            "text": "These are some of my favorite behind-the-scenes moments from my time on the set of @BlackishABC! Make sure to tune into the premiere tonight at 9:30pm ET on ABC. #WWAVBlackish https://t.co/1yTrUADWgt",
            "likes_count": 8598,
            "retweet_count": 929,
            "created_at": "01/05/2022, 01:06:16"
        },
        {
            "text": "You can set a reminder to tune in at 9:30pm ET on ABC—can’t wait for you all to see this episode! https://t.co/I93b3MCGUw",
            "likes_count": 1348,
            "retweet_count": 211,
            "created_at": "01/04/2022, 15:01:23"
        },
        {
            "text": "It was fun being on set with @TraceeEllisRoss and the cast and crew of @BlackishABC! \n\nJoin me and @WhenWeAllVote tonight as we watch the farewell season premiere—and don’t forget to tell me what you think of the episode using #WWAVBlackish. \n\nSo grateful to be a part of it! https://t.co/p7lrVESlIo",
            "likes_count": 8821,
            "retweet_count": 878,
            "created_at": "01/04/2022, 15:01:22"
        },
        {
            "text": "Happy New Year from me and my boo! 🎉🥳 Wishing you all a year filled with happiness, love, and good health. https://t.co/FRR0DDZjw9",
            "likes_count": 1078713,
            "retweet_count": 76308,
            "created_at": "01/01/2022, 23:30:09"
        },
        {
            "text": "Betty White broke barriers, defied expectations, served her country, and pushed us all to laugh. Barack and I join so many around the world who will miss the joy she brought to the world. I know our Bo is looking forward to seeing her up in heaven. https://t.co/tVL7NUw2TT",
            "likes_count": 221579,
            "retweet_count": 13286,
            "created_at": "01/01/2022, 01:33:32"
        }
    ]
}