{
    "username": "ThatBrianFella",
    "followers_count": 39403,
    "statuses_count": 10615,
    "friends_count": 470,
    "favourites_count": 49648,
    "description": "Actor-Artist-Dreamer and a part-time investigator/journalist on here, Instagram (IncrediblyAverageBrian) & YouTube.  I'm always tired.",
    "age": 0,
    "periodicity": 187.0,
    "neg_count": 50,
    "pos_count": 64,
    "neutral_count": 46,
    "tweets_count": 160,
    "tweets": [
        {
            "text": "Today is basically asking people if they like Johnny Depp and if they don't like him anymore. It's all character attacks and nothing to do with anything remotely close to if he abused Amber Heard.",
            "likes_count": 1996,
            "retweet_count": 336,
            "created_at": "05/19/2022, 14:32:09"
        },
        {
            "text": "Really hammering this whole \"Johnny Depp used drugs..he was late to set\" and still no \"I saw him be violent with someone/anyone\".\nNot even a \"he changed when he would drink or do drugs\". Nothing.",
            "likes_count": 1734,
            "retweet_count": 248,
            "created_at": "05/19/2022, 14:16:35"
        },
        {
            "text": "More of Amber Heard's sister, Whitney definitely not saying anything cross about her. It was only Johnny Depp who didn't like being abused and said \"mean\" things 🙄 https://t.co/zo9euprhug https://t.co/LwDdf6cec2",
            "likes_count": 1229,
            "retweet_count": 353,
            "created_at": "05/18/2022, 20:52:40"
        },
        {
            "text": "I'm gonna need a medical professional to tell me that Arnica Cream/Gel does not cause swelling to instantly go down. Maybe I'm wrong but that seems like a miracle in a tube if so.",
            "likes_count": 3275,
            "retweet_count": 296,
            "created_at": "05/18/2022, 20:30:12"
        },
        {
            "text": "Whitney Heard: Johnny would say mean things about Amber. Meanwhile...also Whitney (in grey) talking about her sister: https://t.co/hqcrdvP73w",
            "likes_count": 2921,
            "retweet_count": 563,
            "created_at": "05/18/2022, 18:28:31"
        },
        {
            "text": "Johnny Depp helped Whitney Heard and empathized with her suffering at the hands of Amber Heard. This feels like a look of \"How can you sit there and lie like that?\" Heartbreaking 💔 https://t.co/s6W3jb6nVD",
            "likes_count": 21438,
            "retweet_count": 2404,
            "created_at": "05/18/2022, 18:02:58"
        },
        {
            "text": "This narrative of Amber never did wrong, never had a drug or drinking problem, never needed therapy/help (until Johnny) doesn't play well when we've heard the real Amber in audio already. Painting her as perfect &amp; never in the wrong only shows how much Whitney is willing to lie.",
            "likes_count": 6887,
            "retweet_count": 807,
            "created_at": "05/18/2022, 17:59:42"
        },
        {
            "text": "This is already WAY too rehearsed. Whitney has her jumping off points and has it all at the ready to spill what she was told.",
            "likes_count": 4592,
            "retweet_count": 403,
            "created_at": "05/18/2022, 17:53:25"
        },
        {
            "text": "And we finally get Amber Heard's sister, Whitney...who was abused by Amber as well. It has been said that she is terrified of Amber and is very much willing to repeat her lies because of that. So here we go.",
            "likes_count": 6249,
            "retweet_count": 621,
            "created_at": "05/18/2022, 17:50:34"
        },
        {
            "text": "Josh Drew: Rocky said something bad just happened! So Josh left and went back home to wait...leaving Rocky to run upstairs to potentially have an encounter with \"the monster.\" A gentleman in every sense of the word.",
            "likes_count": 3981,
            "retweet_count": 497,
            "created_at": "05/18/2022, 16:17:09"
        },
        {
            "text": "Josh Drew: Amber hadn't been responding to Rocky's texts on December 15, 2015 &amp; that's what led he &amp; Rocky to let themselves into PH3 when they returned home. But Raquel said it was because Amber summoned her to come over. Which is it? She wasn't responding or she beckoned Rocky?",
            "likes_count": 2323,
            "retweet_count": 370,
            "created_at": "05/18/2022, 16:13:18"
        },
        {
            "text": "Wow what a pose in that picture",
            "likes_count": 761,
            "retweet_count": 36,
            "created_at": "05/18/2022, 15:33:16"
        },
        {
            "text": "What is this body language and these face contortions??",
            "likes_count": 1339,
            "retweet_count": 106,
            "created_at": "05/18/2022, 15:25:10"
        },
        {
            "text": "@TheNamesQ @RockyPMMA @cheeryrosie Please!",
            "likes_count": 262,
            "retweet_count": 4,
            "created_at": "05/18/2022, 14:41:15"
        },
        {
            "text": "I have to wonder if Raquel has been at home watching the trial. And if so...hearing/seeing everything that has come to light about Amber Heard...if she feels like a fool for being fooled.",
            "likes_count": 6807,
            "retweet_count": 466,
            "created_at": "05/18/2022, 14:13:20"
        },
        {
            "text": "The sighs at the end of each of Raquel's dull toned answers cannot be going over well with the jurors. But what do I know? @LumberLaw @KyDUIGuy @legalbytesmedia What say you?",
            "likes_count": 2295,
            "retweet_count": 143,
            "created_at": "05/18/2022, 13:58:00"
        },
        {
            "text": "Where are the pictures of ALL that blood? It should be everywhere right? Bed. Hair. Face. All of it! Instead we get splinters and split ends.",
            "likes_count": 4088,
            "retweet_count": 458,
            "created_at": "05/18/2022, 13:40:05"
        },
        {
            "text": "Raquel knowing Amber Heard didn't have the injuries she claimed Johnny Depp allegedly gave her. Trying to match what Amber said. But nothing she says nor the pics line up with what AH claimed. Tired? Chapped lips? Botox? Maybe. But not the life threatening event AH testified to.",
            "likes_count": 2052,
            "retweet_count": 274,
            "created_at": "05/18/2022, 13:37:40"
        },
        {
            "text": "The stream of the Johnny Depp v Amber Heard trial is one sick beat this morning! Anyone have any MDMA?? https://t.co/vtOnvZEI7c",
            "likes_count": 377,
            "retweet_count": 31,
            "created_at": "05/18/2022, 13:09:29"
        },
        {
            "text": "@jkhowell1 Can. But in this case...won't. Thank you for always speaking up and standing up for what's right! You have a world of support with you!",
            "likes_count": 82,
            "retweet_count": 0,
            "created_at": "05/18/2022, 12:16:24"
        },
        {
            "text": "Amber Heard's \"key witnesses\" were once her closest friends during what she describes as the worst time of her life. They only \"know\" what she told them. They're also no longer her friends. Let that sink in, because I think it speaks louder than any of their parroted testimony.",
            "likes_count": 14880,
            "retweet_count": 1897,
            "created_at": "05/17/2022, 21:36:27"
        },
        {
            "text": "To summarize...IO saw nothing, witnessed nothing, and knows next to nothing about the actual dynamic that was Johnny Depp &amp; Amber Heard's relationship. He has a really high opinion of himself. But ultimately was just another Amber pawn who bought whatever she told him. End of.",
            "likes_count": 8779,
            "retweet_count": 1040,
            "created_at": "05/17/2022, 20:52:34"
        },
        {
            "text": "IO loves IO. That much is true.",
            "likes_count": 3520,
            "retweet_count": 203,
            "created_at": "05/17/2022, 20:01:27"
        },
        {
            "text": "Amber Heard just said she wouldn't know how to leak things and that's not her area of expertise...following up with how if she wanted to she could have done it better than that. Make it make sense.",
            "likes_count": 8022,
            "retweet_count": 852,
            "created_at": "05/17/2022, 18:37:01"
        },
        {
            "text": "She is slipping!!",
            "likes_count": 2777,
            "retweet_count": 126,
            "created_at": "05/17/2022, 18:34:56"
        },
        {
            "text": "\"Play it (again) Sam\"\n\n- Casablanca \nhttps://t.co/f5cWyRndZf",
            "likes_count": 408,
            "retweet_count": 60,
            "created_at": "05/17/2022, 18:13:15"
        },
        {
            "text": "\"I was hitting you!\"\n\n-Amber Heard",
            "likes_count": 2556,
            "retweet_count": 208,
            "created_at": "05/17/2022, 18:03:32"
        },
        {
            "text": "Yes! Sit there and listen with the world, Amber! Listen to yourself as you abuse Johnny Depp and admit it.",
            "likes_count": 3894,
            "retweet_count": 353,
            "created_at": "05/17/2022, 18:01:27"
        },
        {
            "text": "I'm no expert. But I don't feel like that went well for Amber Heard.",
            "likes_count": 20333,
            "retweet_count": 1283,
            "created_at": "05/17/2022, 16:36:02"
        },
        {
            "text": "You're busted Amber. You wrote the Op Ed. It was clearly about Johnny. You were proud enough to write it, publish it, tweet it, and take all the good press that came with it at the time. Own it now like you did back then.",
            "likes_count": 3749,
            "retweet_count": 535,
            "created_at": "05/17/2022, 16:11:08"
        },
        {
            "text": "Amber Heard testified these 2 photos are not the same photo but rather one with a light off &amp; on. That they are not the same photo, simply over saturated (on the left). We have eyes. They're identical. One (originally submitted by Heard as evidence of injuries). Guess which one. https://t.co/9svJh5nIke",
            "likes_count": 1259,
            "retweet_count": 213,
            "created_at": "05/17/2022, 15:48:44"
        },
        {
            "text": "Amber Heard loves to fight. More importantly she craves absolute control. We are listening to her beg Johnny Depp to submit to her. Give her control and let her fight. Not even one mention of stopping him from \"using\". She wanted ownership...and he was taking that away.",
            "likes_count": 3745,
            "retweet_count": 431,
            "created_at": "05/17/2022, 15:41:06"
        },
        {
            "text": "Johnny Depp would leave to create space between him and Amber Heard. And she would text and call him nonstop! Stalking him! And she is trying to twist that to say she was doing so to \"stop the cycle\" and keep it from getting worse. Nobody is buying this",
            "likes_count": 6007,
            "retweet_count": 659,
            "created_at": "05/17/2022, 15:36:05"
        },
        {
            "text": "\"Mr. Depp got you that role in Aquaman, didn't he?\" https://t.co/VJtp6zKYdh",
            "likes_count": 940,
            "retweet_count": 126,
            "created_at": "05/17/2022, 15:28:21"
        },
        {
            "text": "My god that super villain laugh of Amber Heard in the audio. Bone chilling. Psychotic.",
            "likes_count": 17593,
            "retweet_count": 1568,
            "created_at": "05/17/2022, 15:23:03"
        },
        {
            "text": "What's the saying the kids use these days? Amber Heard just got \"caught in 4K!\"\nUninjured. Broken nose, possible broken ribs, large clumps of hair missing, busted lip? Nah",
            "likes_count": 2174,
            "retweet_count": 211,
            "created_at": "05/17/2022, 14:20:52"
        },
        {
            "text": "So now the testimony is he swung at Whitney...not pushed or attempted to push.",
            "likes_count": 2521,
            "retweet_count": 203,
            "created_at": "05/17/2022, 14:03:08"
        },
        {
            "text": "And there you have it. Amber Heard didn't suffer from a \"3 day hostage incident\" at the hands of Johnny Depp in Australia!! She assaulted him! Cut off his finger! She chased him from room to room while he tried to escape his abuser!\n#JusticeForJohnnyDepp \n#AmberHeardIsAnAbuser https://t.co/QUzcBhucsM",
            "likes_count": 1659,
            "retweet_count": 327,
            "created_at": "05/17/2022, 13:49:52"
        },
        {
            "text": "Amber Heard was not injured in Australia! Described the most horrific injuries and only took pictures of 2 mirrors.",
            "likes_count": 6604,
            "retweet_count": 589,
            "created_at": "05/17/2022, 13:40:04"
        },
        {
            "text": "Picking up where we left off. Amber Heard is a liar and an abuser. Please continue, Camille.",
            "likes_count": 3912,
            "retweet_count": 405,
            "created_at": "05/17/2022, 13:07:18"
        },
        {
            "text": "@Ainamzas I'm so sorry 💔 I can't imagine what you're feeling and hope a second opinion can offer more options.",
            "likes_count": 14,
            "retweet_count": 0,
            "created_at": "05/17/2022, 12:49:07"
        },
        {
            "text": "@realnitpicker @TheNamesQ @LauraBockov Thank you and so many others!",
            "likes_count": 21,
            "retweet_count": 0,
            "created_at": "05/17/2022, 02:39:43"
        },
        {
            "text": "If you want my opinion, today the jury got to see exactly what Johnny Depp said about Amber Heard, and it was/is true. That no matter what...she is never wrong.\n#JusticeForJohnnyDepp #JohnnyDeppVsAmberHeard \n#AmberHeardIsAnAbuser",
            "likes_count": 5674,
            "retweet_count": 646,
            "created_at": "05/16/2022, 21:53:41"
        },
        {
            "text": "If Amber Heard refuses to say there is a difference between \"pledge\" and \"donate\"...just wait til we get to \"punch\" vs \"hit\". Buckle up!",
            "likes_count": 15701,
            "retweet_count": 1691,
            "created_at": "05/16/2022, 21:41:04"
        },
        {
            "text": "What a wonderful day",
            "likes_count": 3293,
            "retweet_count": 235,
            "created_at": "05/16/2022, 21:30:05"
        },
        {
            "text": "Pledge =/= Donated\n\nThis concludes my Ted Talk.",
            "likes_count": 4083,
            "retweet_count": 494,
            "created_at": "05/16/2022, 21:14:38"
        },
        {
            "text": "She doesn't look as confident now. Wonder why...",
            "likes_count": 2893,
            "retweet_count": 244,
            "created_at": "05/16/2022, 20:14:54"
        },
        {
            "text": "Amber Heard was never injured after any of the alleged horrific beatings (often exclusively to her face) by a multi-ringed hands and fists of Johnny Depp. There is no makeup that will cover that...or swelling. She is uninjured. But now there's ice involved.",
            "likes_count": 5978,
            "retweet_count": 778,
            "created_at": "05/16/2022, 20:05:50"
        },
        {
            "text": "Yes Camille! Come out of the gate calling Amber Heard exactly what she is...an abuser!!",
            "likes_count": 8197,
            "retweet_count": 781,
            "created_at": "05/16/2022, 19:52:23"
        },
        {
            "text": "Again...Amber Heard playing to the jury with every single answer. Proud she has stared Johnny down while acknowledging she has noticed he hasn't looked at her once.",
            "likes_count": 2731,
            "retweet_count": 235,
            "created_at": "05/16/2022, 19:48:37"
        },
        {
            "text": "And now for the real Amber Heard to show up. Cross examination is next!",
            "likes_count": 3707,
            "retweet_count": 303,
            "created_at": "05/16/2022, 19:21:49"
        },
        {
            "text": "Wow that was some bad acting...",
            "likes_count": 1429,
            "retweet_count": 67,
            "created_at": "05/16/2022, 19:20:13"
        },
        {
            "text": "Amber Heard just said she has mountains of evidence!\n\nAnd clearly decided to bring none of it to this trial.",
            "likes_count": 13301,
            "retweet_count": 1500,
            "created_at": "05/16/2022, 18:46:13"
        },
        {
            "text": "Amber Heard throwing literally EVERYBODY under the bus!! Lawyers, ACLU, Elon, Washington Post. All of 'em.",
            "likes_count": 15895,
            "retweet_count": 1667,
            "created_at": "05/16/2022, 18:26:50"
        },
        {
            "text": "Amber Heard \"sadly\" looking over at the jury as the audio of her gaslighting Johnny plays...to see if they buy it. Conveniently cutting off before the crazy comes out of her in the very same tape. Cross should get interesting when she is made to listen to the rest of it.",
            "likes_count": 4164,
            "retweet_count": 454,
            "created_at": "05/16/2022, 18:02:57"
        },
        {
            "text": "Amber Heard says after the May 2016 incident she was terrified, no sleep, had hair loss, shingles, changed locks. Also Amber:\nNever before seen 2016 Depo footage!\nTrying to reach Johnny Depp in the days following &amp; admitting to alerting TMZ! Her body tries to stop her! Too late! https://t.co/UaW4clpxUL",
            "likes_count": 3378,
            "retweet_count": 858,
            "created_at": "05/16/2022, 17:10:27"
        },
        {
            "text": "Now all of sudden the makeup kit isn't the exact one she used back then...ok.\nShe knows exactly what colors to use to cover a bruise...or to create one.",
            "likes_count": 4526,
            "retweet_count": 550,
            "created_at": "05/16/2022, 16:36:42"
        },
        {
            "text": "@thatsfunnymel @Noneofthemknew1 That's a wonderful idea!",
            "likes_count": 18,
            "retweet_count": 0,
            "created_at": "05/16/2022, 16:19:00"
        },
        {
            "text": "The 2016 deposition of Amber’s best friend Rocky. What a messy crime scene! 🙄 https://t.co/qStafOmkgJ",
            "likes_count": 537,
            "retweet_count": 101,
            "created_at": "05/16/2022, 16:17:13"
        },
        {
            "text": "One of these pictures are of the \"horrible\" injuries allegedly caused by Johnny Depp on May 21, 2016. The other is late July, 2018 long after Johnny and Amber divorced. https://t.co/hzLHIb2SWT",
            "likes_count": 5164,
            "retweet_count": 1041,
            "created_at": "05/16/2022, 15:54:59"
        },
        {
            "text": "Amber asked security to not let Johnny into PH5 but I thought she was being hidden and protected in PH1 with Rocky and Josh.",
            "likes_count": 2327,
            "retweet_count": 262,
            "created_at": "05/16/2022, 15:50:17"
        },
        {
            "text": "If Amber Heard was injured and getting worse looking as the night went on...why try to say you showed the first set of officers pictures? Wouldn't they see the alleged injuries? If they existed...",
            "likes_count": 1662,
            "retweet_count": 237,
            "created_at": "05/16/2022, 15:36:04"
        },
        {
            "text": "@Izze1122 That's infuriating.",
            "likes_count": 23,
            "retweet_count": 2,
            "created_at": "05/16/2022, 15:30:37"
        },
        {
            "text": "Amber Heard, knowing she took too many drugs and drank too much....trying to play it off jokingly as something almost adorable that she did. After testifying multiple times that she didn't have a substance abuse problem.",
            "likes_count": 2225,
            "retweet_count": 328,
            "created_at": "05/16/2022, 14:36:41"
        },
        {
            "text": "She texted...and used her phone to try to find Johnny's phone, which had actually been thrown out the window. But says he threw hers out the window first.",
            "likes_count": 4005,
            "retweet_count": 586,
            "created_at": "05/16/2022, 14:28:40"
        },
        {
            "text": "Amber's tone in that kitchen video when she got caught taping Johnny Depp. She actually got aggressive when saying \"You were smashing shit\" before Johnny immediately decided to leave.",
            "likes_count": 1179,
            "retweet_count": 162,
            "created_at": "05/16/2022, 14:16:43"
        },
        {
            "text": "Amber Heard attempting to explain away a tape of her admitting to hitting Johnny Depp and starting physical fights while hearing nothing about any violence on his part is borderline comical. And the mental gymnastics begin.",
            "likes_count": 2802,
            "retweet_count": 425,
            "created_at": "05/16/2022, 13:55:39"
        },
        {
            "text": "I wonder what movie the train incident is from.",
            "likes_count": 1128,
            "retweet_count": 74,
            "created_at": "05/16/2022, 13:37:56"
        },
        {
            "text": "There's so much coaching going on from Elaine to Amber. You think some coaching occurred during the break as well? Me thinks so.",
            "likes_count": 6686,
            "retweet_count": 705,
            "created_at": "05/16/2022, 13:27:35"
        },
        {
            "text": "Amber Heard starting off by correcting that she testified multiple times to \"getting the date wrong\" as to when Johnny Depp allegedly hit her. She was off by a year. After previously testifying that \"you never forget the first time\". Again...off by a year.",
            "likes_count": 10899,
            "retweet_count": 1421,
            "created_at": "05/16/2022, 13:12:21"
        },
        {
            "text": "Birds of a feather...\n https://t.co/u6Jrlaby4P",
            "likes_count": 846,
            "retweet_count": 174,
            "created_at": "05/16/2022, 12:23:10"
        },
        {
            "text": "And now this. None of Johnny Depp's exes have alleged abuse. None. This guy just hopes you won't seek that information out. He offered no proof because there is none. He'll simply tell you it's it court documents. It isn't. Lazy emotional/agenda driven \"journalism\". https://t.co/nm4QNqInZp",
            "likes_count": 672,
            "retweet_count": 104,
            "created_at": "05/16/2022, 12:20:55"
        },
        {
            "text": "Sp full of misinformation. Amber Heard states that it's still recording toward the end of the 2hr tape. She knew. So go ahead and listen to the entire thing...with \"context\". Because it's actually worse for her that way. This one knows so little but wants you to listen to him. https://t.co/3aV6jVBVKe",
            "likes_count": 492,
            "retweet_count": 60,
            "created_at": "05/16/2022, 12:18:42"
        },
        {
            "text": "Or because the entire Johnny Depp v Amber Heard trial is being streamed live, the mainstream media knows it can't get away with lying to the public anymore. So they pretend it isn't worth \"covering\" in the hopes of limiting bad press against her &amp; their long-standing narrative. https://t.co/xYpZMqhuFA",
            "likes_count": 1078,
            "retweet_count": 178,
            "created_at": "05/16/2022, 12:07:24"
        },
        {
            "text": "Remember that time Amber Heard liked and responded to tweets about how beautiful it is that she loves to fight. Maybe not as openly proud of it now that she is on the stand pretending to be meek. https://t.co/DDqCoTcZF8",
            "likes_count": 1745,
            "retweet_count": 331,
            "created_at": "05/15/2022, 21:18:36"
        },
        {
            "text": "@Ainamzas I'm so sorry. Hoping it's not the case. Sending all the love to you and that handsome boy! 💙",
            "likes_count": 18,
            "retweet_count": 0,
            "created_at": "05/15/2022, 01:58:46"
        },
        {
            "text": "@aburkhartlaw Awesome!",
            "likes_count": 73,
            "retweet_count": 0,
            "created_at": "05/15/2022, 01:04:51"
        },
        {
            "text": "She doesn't have a drinking problem... https://t.co/WqoM39aZI9",
            "likes_count": 5509,
            "retweet_count": 1146,
            "created_at": "05/14/2022, 21:01:01"
        },
        {
            "text": "@RamonHitOrMiss @andysignore @LauraBockov I actually have a nice mic but was just using my phone 😂 Next time I'll make sure to do a full setup for it and get it all figured out before I go back on there or anywhere really.",
            "likes_count": 17,
            "retweet_count": 0,
            "created_at": "05/14/2022, 05:09:46"
        },
        {
            "text": "Friendly reminder that professional fake victim Amber Heard, when not having her friends/family move into Johnny Depp's penthouses (rent free) she was filling the largest of them (she claimed as her personal closet) with designer clothes, bags &amp; shoes we know she couldn't afford. https://t.co/28j0sak7AA https://t.co/VotSmzoZ0q",
            "likes_count": 1211,
            "retweet_count": 216,
            "created_at": "05/14/2022, 03:37:28"
        },
        {
            "text": "Sorry for my audio issues everyone. I'll get it sorted out and get back on sometime soon! Really enjoyed the conversation! Thanks for having me @andysignore And always good to talk with @LauraBockov 💙 https://t.co/XV41tFZmfi",
            "likes_count": 1112,
            "retweet_count": 127,
            "created_at": "05/13/2022, 19:55:31"
        },
        {
            "text": "@reineyelah @TheNamesQ 🙏💙",
            "likes_count": 12,
            "retweet_count": 0,
            "created_at": "05/12/2022, 20:18:51"
        },
        {
            "text": "Amber Heard has lied on so many continents. And with the world watching...this isn't surprising at all!\n\nhttps://t.co/7ivv11e3tF",
            "likes_count": 3176,
            "retweet_count": 507,
            "created_at": "05/11/2022, 17:01:50"
        },
        {
            "text": "This guy knows his stuff...on many levels. Check him out! A completely unique approach to debunking Amber Heard's allegations against Johnny Depp.\nhttps://t.co/mR7X9pfsV7",
            "likes_count": 2442,
            "retweet_count": 424,
            "created_at": "05/11/2022, 14:22:17"
        },
        {
            "text": "Amber Heard thought she did something with this chapped split lip she's had before &amp; after being with Johnny Depp. It actually proves she'd use whatever she could to frame him early on. And being \"off\" about the date...by a year? I don't think so, Ms. \"Birds, bees &amp; dirty carpet\" https://t.co/GoVrv6gb5I",
            "likes_count": 2378,
            "retweet_count": 408,
            "created_at": "05/11/2022, 11:58:25"
        },
        {
            "text": "@TheNamesQ 🎵 And it feels so good 🎵",
            "likes_count": 41,
            "retweet_count": 0,
            "created_at": "05/10/2022, 20:36:53"
        },
        {
            "text": "This! Johnny Depp endured being hated for 6 years! Viral posts, videos &amp; articles from the public &amp; media alike. Many saying the most revolting things about him as a husband, father &amp; person. They want you to \"ease up\" the second the world knows Amber Heard is the abuser? No. https://t.co/acHWMD6Ywq",
            "likes_count": 3296,
            "retweet_count": 674,
            "created_at": "05/10/2022, 11:44:12"
        },
        {
            "text": "@MarieWatsen Ed Wood. A must watch of his catalog!",
            "likes_count": 153,
            "retweet_count": 4,
            "created_at": "05/09/2022, 00:45:18"
        },
        {
            "text": "@OT9LoL @Asmongold @CatDanyRU Thank you! Fingers crossed🤞",
            "likes_count": 3,
            "retweet_count": 0,
            "created_at": "05/08/2022, 23:28:02"
        },
        {
            "text": "@Asmongold Wanted to reach out here. Not trying to sound salty but if you could link my (2 year old) video/channel instead of one called Film Streak, who I guess took my original a couple days ago. This is the video of yours I'm referring to. Thanks man!\nhttps://t.co/3hxnA3Jh8F",
            "likes_count": 379,
            "retweet_count": 64,
            "created_at": "05/08/2022, 23:21:49"
        },
        {
            "text": "Well done!!\n#MenToo \n#JusticeForJohnnyDepp https://t.co/teQFP74qHd",
            "likes_count": 1372,
            "retweet_count": 155,
            "created_at": "05/08/2022, 15:14:17"
        },
        {
            "text": "@ChristinaPykles @TheNamesQ 🤣🤣",
            "likes_count": 29,
            "retweet_count": 0,
            "created_at": "05/07/2022, 04:44:24"
        },
        {
            "text": "Women are great! They are strong, intelligent, caring and a plethora of so many other wonderful qualities! \n\nAnd then there's Amber Heard.\nStop shielding an abuser with buzzwords.\n#JohnnyDeppVsAmberHeard \n#JusticeForJohnnyDepp https://t.co/sd1icBzX0H",
            "likes_count": 4732,
            "retweet_count": 640,
            "created_at": "05/06/2022, 21:27:49"
        },
        {
            "text": "Sliced, bruised, cut, swollen...\nThe works. Yea ok.\n#JusticeForJohnnyDepp #JohnnyDeppVsAmberHeard https://t.co/J4jDIeXoIc",
            "likes_count": 2007,
            "retweet_count": 374,
            "created_at": "05/05/2022, 23:03:57"
        },
        {
            "text": "One of these pics is an irritated scalp from bad hair dye. The other is a photo Amber Heard is using to say Johnny Depp ripped large chunks of hair from her head, causing it to bleed heavily...nevermind we don't see if it's even her in the picture. Not identical but come on... https://t.co/72novlWuyv",
            "likes_count": 2466,
            "retweet_count": 322,
            "created_at": "05/05/2022, 21:33:33"
        },
        {
            "text": "And the headbutt, near death experience of December 2015. Here we go folks!",
            "likes_count": 1788,
            "retweet_count": 142,
            "created_at": "05/05/2022, 20:49:34"
        },
        {
            "text": "@LisaGandini Saw that!",
            "likes_count": 166,
            "retweet_count": 0,
            "created_at": "05/05/2022, 20:44:31"
        },
        {
            "text": "The projection Amber Heard is making heavy use of here about the March 23, 2015 incident. Wow! You're on tape talking about hitting him over and over! Stop lying! We've heard the truth already!",
            "likes_count": 1728,
            "retweet_count": 282,
            "created_at": "05/05/2022, 20:44:17"
        },
        {
            "text": "Now there are 2 phones...within feet of each other. No evidence of the broken phone because Amber Heard claims 'they' must have cleaned some stuff up and then snapped the bar pic. Conveniently removing the shattered phone she says Johnny injured his finger with.",
            "likes_count": 3152,
            "retweet_count": 354,
            "created_at": "05/05/2022, 19:42:17"
        },
        {
            "text": "She says she doesn't know if the bottom was broken that was used on her but now Amber Heard claims that she recognized the (square) bottle...seemingly intacted, by seeing a picture for the first time a couple of days ago. https://t.co/dniMSd1ze3",
            "likes_count": 697,
            "retweet_count": 105,
            "created_at": "05/05/2022, 19:38:02"
        },
        {
            "text": "I don't remember...I remember...I don't remember...I remember",
            "likes_count": 4537,
            "retweet_count": 405,
            "created_at": "05/05/2022, 19:08:58"
        },
        {
            "text": "Amber Heard is literally on audio mocking Johnny Depp for him hiding from her in at least 7 different rooms in Australia!",
            "likes_count": 17289,
            "retweet_count": 1875,
            "created_at": "05/05/2022, 19:05:37"
        },
        {
            "text": "Did she just sat \"It's ok..\" to nobody before that breakdown?",
            "likes_count": 1138,
            "retweet_count": 77,
            "created_at": "05/05/2022, 19:03:43"
        },
        {
            "text": "So she just can't remember how they got off the games table when he kept \"whacking\" her in the face over and over to an argument moments later by the bar.",
            "likes_count": 1229,
            "retweet_count": 122,
            "created_at": "05/05/2022, 18:55:57"
        },
        {
            "text": "Honestly at this point I'm waiting for \"Line?\"",
            "likes_count": 1946,
            "retweet_count": 154,
            "created_at": "05/05/2022, 18:52:20"
        },
        {
            "text": "At some point...",
            "likes_count": 320,
            "retweet_count": 14,
            "created_at": "05/05/2022, 18:40:09"
        },
        {
            "text": "Amber Heard pretending to gasp and be offended that Johnny Depp would dare offer her MDMA. Like how could she even be expected to enjoy such a drug? The angel.",
            "likes_count": 9017,
            "retweet_count": 660,
            "created_at": "05/05/2022, 18:40:01"
        },
        {
            "text": "Amber Heard testifying now that these very vague texts from Johnny are his way of apologizing for being too physical with her. That sometimes he wouldn't even know how much he could hurt her...but I thought she never felt the pain. She would just freeze in shock. Which is it?",
            "likes_count": 2006,
            "retweet_count": 208,
            "created_at": "05/05/2022, 16:59:12"
        },
        {
            "text": "\"At one point...\"\n\nA favorite phrase for liars. Take a shot game for that? No thanks.",
            "likes_count": 596,
            "retweet_count": 51,
            "created_at": "05/05/2022, 16:29:46"
        },
        {
            "text": "Amber Heard who insisted on being the one to help Johnny Depp detox...now claims she shouldn't have been allowed to do so and didn't know how. Meanwhile she previously testified to having helped her addict parents with their addictions her entire life!",
            "likes_count": 8194,
            "retweet_count": 975,
            "created_at": "05/05/2022, 16:28:51"
        },
        {
            "text": "No Amber, you can't just speak and testify for others like you have for the past 6 years!",
            "likes_count": 2802,
            "retweet_count": 341,
            "created_at": "05/05/2022, 16:18:19"
        },
        {
            "text": "Johnny’s side is not letting Amber spin her feelings about \"what so many victims do\" narrative. Woot woot!",
            "likes_count": 1613,
            "retweet_count": 165,
            "created_at": "05/05/2022, 16:08:23"
        },
        {
            "text": "Again Amber got \"kicked\"....in the back she sighs. And once again nobody, including her did anything and she could only focus on the shock and questioning of it. And the floor. And blah blah...small details.",
            "likes_count": 1632,
            "retweet_count": 173,
            "created_at": "05/05/2022, 15:19:20"
        },
        {
            "text": "Amber Heard says she \"knew\" Johnny Depp had been \"using\" a combination of specific drugs and alcohol without actually KNOWING he had taken anything at all.",
            "likes_count": 3183,
            "retweet_count": 291,
            "created_at": "05/05/2022, 15:13:39"
        },
        {
            "text": "Amber Heard always trying to act like the savior of Johnny Depp's children. Stop it. #JusticeForJohnnyDepp #JohnnyDeppVsAmberHeard",
            "likes_count": 7038,
            "retweet_count": 618,
            "created_at": "05/05/2022, 14:40:01"
        },
        {
            "text": "@andysignore Behave yourself!",
            "likes_count": 134,
            "retweet_count": 3,
            "created_at": "05/05/2022, 14:36:20"
        },
        {
            "text": "A year old thread well worth looking over. Well done! https://t.co/QGPaJ5MaqL",
            "likes_count": 704,
            "retweet_count": 194,
            "created_at": "05/05/2022, 10:25:17"
        },
        {
            "text": "The most believable moment from today's testimony was when Amber Heard was longing for that private island again.",
            "likes_count": 4934,
            "retweet_count": 414,
            "created_at": "05/05/2022, 01:52:54"
        },
        {
            "text": "@Virtual_Barbie Yup she's just rattling it off as fast as she can, lest she forget.",
            "likes_count": 169,
            "retweet_count": 0,
            "created_at": "05/04/2022, 22:16:05"
        },
        {
            "text": "Amber Heard: \"Johnny Depp slammed me against the wall and held me there by my throat and told me he could kill me...and that hurt my feelings.\"\n\nI'm not making this up",
            "likes_count": 22077,
            "retweet_count": 2065,
            "created_at": "05/04/2022, 20:55:08"
        },
        {
            "text": "The intense looks of crazy and anger that seem to flood to the surface here. https://t.co/svovboZ1i5",
            "likes_count": 1805,
            "retweet_count": 264,
            "created_at": "05/04/2022, 20:37:57"
        },
        {
            "text": "\"My dog stepped on a bee...\"\n\nDefinitive proof Amber Heard is telling the truth. So many little details",
            "likes_count": 3658,
            "retweet_count": 267,
            "created_at": "05/04/2022, 20:29:33"
        },
        {
            "text": "Amber Heard piecing together of this Hicksville story. Adding as she goes. Multiple takes of some lines. Ending every sentence out of breath in a whisper. Bonkers. She is trying. Must be dehydrated too. Nothing is coming.",
            "likes_count": 2548,
            "retweet_count": 282,
            "created_at": "05/04/2022, 20:26:56"
        },
        {
            "text": "Boo is now Johnny's dog, chunky &amp; has the bowel problems. Laying groundwork.\n\nAlso interesting how nobody, even Amber ever reacted to \"abuse he committed.\" The slaps, the dog out the window. Nothing. Not a peep. No movement. Always stunned silence. We've. Heard. The. Tapes!",
            "likes_count": 1349,
            "retweet_count": 188,
            "created_at": "05/04/2022, 20:14:08"
        },
        {
            "text": "Amber Heard doing what Amber Heard does. Passing every single ounce of blame and casting herself in a \"perfect\" light. We've heard the tapes! We've seem the evidence! You can't argue that he was a monster while you were this angel sent to him from on high. Not now.",
            "likes_count": 5637,
            "retweet_count": 751,
            "created_at": "05/04/2022, 19:31:28"
        },
        {
            "text": "This could have used a few more rehearsals to help clean it up.",
            "likes_count": 2705,
            "retweet_count": 211,
            "created_at": "05/04/2022, 19:10:04"
        },
        {
            "text": "Flashes of anger are coming through instead of the tears and sadness Amber Heard is trying to sell. And the daytime Emmy goes to...",
            "likes_count": 4465,
            "retweet_count": 432,
            "created_at": "05/04/2022, 19:04:16"
        },
        {
            "text": "Amber Heard already trying to portray Johnny Depp as a predator when talking about the kissing scene in The Rum Diaries.",
            "likes_count": 9387,
            "retweet_count": 705,
            "created_at": "05/04/2022, 18:24:41"
        },
        {
            "text": "Amber Heard already letting everyone know she was a charitable, super tough, child-genius who taught herself everything. Amazing story!",
            "likes_count": 5980,
            "retweet_count": 496,
            "created_at": "05/04/2022, 18:15:16"
        },
        {
            "text": "We call Laura Amber Heard your honor.\n\nSmashing start Elaine...",
            "likes_count": 3045,
            "retweet_count": 209,
            "created_at": "05/04/2022, 18:03:23"
        },
        {
            "text": "Unseen footage from Amber Heard's 2016 Deposition, about throwing a can of mineral spirits at Johnny Depp's face!\nDr. Hughes preemptively testifying on her behalf...when in 2016 Amber already initially denied it under oath. Weave that narrative girl! https://t.co/3h0GbdISvc",
            "likes_count": 2855,
            "retweet_count": 535,
            "created_at": "05/04/2022, 16:07:54"
        },
        {
            "text": "Boom! https://t.co/uPkuGvn4hh",
            "likes_count": 1038,
            "retweet_count": 212,
            "created_at": "05/04/2022, 14:19:24"
        },
        {
            "text": "Such a terrible jumping off point for Amber Heard's side.",
            "likes_count": 4697,
            "retweet_count": 278,
            "created_at": "05/03/2022, 20:52:27"
        },
        {
            "text": "She said she said she said...",
            "likes_count": 4206,
            "retweet_count": 469,
            "created_at": "05/03/2022, 20:20:14"
        },
        {
            "text": "Amber Heard's mental expert opinion: \"Ms. Heard demonstrated very clear psychological &amp; traumatic effects, the exacerbation of trauma from 3 statements that Mr. Depp made through his attorney.\"\n\nBack in reality, \"PTSD\" victim Amber Heard... https://t.co/9GrnM0z6cD",
            "likes_count": 2306,
            "retweet_count": 624,
            "created_at": "05/03/2022, 20:17:49"
        },
        {
            "text": "Amber Heard's psychologist already wanting to establish that she should be allowed to assault Johnny Depp more because of size difference. Like Amber openly used (in audio) to belittle Johnny when he would complain about her abusing him.",
            "likes_count": 8299,
            "retweet_count": 1080,
            "created_at": "05/03/2022, 18:19:48"
        },
        {
            "text": "Ok folks. I should say, yes this is part of the process/common \"tactic\" after the plaintiff rests. My point was more about how over it I am with the attempt after the several pretrial. Apologies to everyone correcting me/pointing out the irresponsibility or ignorance of my tweet. https://t.co/N8KUyiFicd",
            "likes_count": 374,
            "retweet_count": 24,
            "created_at": "05/03/2022, 16:37:56"
        },
        {
            "text": "@JustSlaythe Been a long few weeks. I don't recall being told but I'm sure you're correct. \n\nEase up with the scolding.",
            "likes_count": 129,
            "retweet_count": 1,
            "created_at": "05/03/2022, 16:28:15"
        },
        {
            "text": "@pearce_bel Understood. As a layman, I'm just over this stuff I guess.",
            "likes_count": 47,
            "retweet_count": 0,
            "created_at": "05/03/2022, 16:15:29"
        },
        {
            "text": "Johnny Depp rests his case...immediately followed by yet another dismissal attempt by Amber Heard's team. If the truth is on your side, you don't run from it.",
            "likes_count": 12880,
            "retweet_count": 1417,
            "created_at": "05/03/2022, 16:07:02"
        },
        {
            "text": "But Cyabra, a Tel Aviv-based startup that analyzes online conversations and spots disinformation, believes that Depp’s online fan base is overwhelmingly real...\n\nThe truth will win in the end! https://t.co/A1beZ0GH0U",
            "likes_count": 407,
            "retweet_count": 54,
            "created_at": "05/03/2022, 15:48:22"
        },
        {
            "text": "Not attending today. Resting up for Wednesday and Thursday since the line game deteriorated into whatever yesterday was. With no indication things will be less hectic going forward...I'll take another shot at it tomorrow morning.",
            "likes_count": 777,
            "retweet_count": 28,
            "created_at": "05/03/2022, 14:00:56"
        },
        {
            "text": "Richard Marx laid the foundation as an expert and then demonstrated that with his cross examination. Let it be known that his Hollywood is not the same Hollywood as the media tries to spin it as!",
            "likes_count": 1261,
            "retweet_count": 144,
            "created_at": "05/02/2022, 19:23:16"
        },
        {
            "text": "Current witness for Johnny Depp, Richard Marx: \"Hey remember all those actors and movies you loved growing up? Yea that was me.\"\nThis dude's resumé is insane.",
            "likes_count": 2999,
            "retweet_count": 254,
            "created_at": "05/02/2022, 16:58:55"
        },
        {
            "text": "@depplyhaIIows @TheNamesQ I'll take that as a compliment? 🤣",
            "likes_count": 53,
            "retweet_count": 0,
            "created_at": "05/02/2022, 15:52:42"
        },
        {
            "text": "Johnny Depp has the POTC 6 deal and lost it after Amber Heard's Op Ed!! Confirmed!! Defamation!!",
            "likes_count": 6950,
            "retweet_count": 989,
            "created_at": "05/02/2022, 15:45:19"
        },
        {
            "text": "I'm in! Number 86! The rest of the week I expect to be as bad or worse trying to get in.",
            "likes_count": 1581,
            "retweet_count": 59,
            "created_at": "05/02/2022, 11:39:27"
        },
        {
            "text": "@SpeakOfTheDev13 Already the best news of the day! 🙏💙",
            "likes_count": 15,
            "retweet_count": 0,
            "created_at": "05/02/2022, 10:13:44"
        },
        {
            "text": "@ffsnoidea Exactly this",
            "likes_count": 46,
            "retweet_count": 2,
            "created_at": "05/02/2022, 09:34:29"
        },
        {
            "text": "Got here early like always. Probably around 80/100 (max capacity) in line. But some line cutting has occurred. So...might not get entry now. People saving spots &amp; whatnot (not allowed). No decorum. What a circus. Come say hello. But then get back in your spot 😆\n\nBut seriously...",
            "likes_count": 1199,
            "retweet_count": 57,
            "created_at": "05/02/2022, 09:12:37"
        },
        {
            "text": "This was an edit of one of the Aquaman movie posters I did. Yes, it's petty. Yes, it's childish. Yes, it's still a little funny to me. Because Amber Heard did a thing and the world will likely never forget it now. https://t.co/cpPJaXFmIo",
            "likes_count": 5032,
            "retweet_count": 727,
            "created_at": "05/01/2022, 06:25:11"
        },
        {
            "text": "@TheNamesQ I echo this 1000%!!",
            "likes_count": 178,
            "retweet_count": 12,
            "created_at": "04/30/2022, 19:07:14"
        },
        {
            "text": "Emotionally tortured male DV victims are hilarious y'all. Absolutely disgusting to pass over horrendous acts with a laugh of \"They're so crazy it's so funny!\" 🙄🤢 https://t.co/kgptPrca3d",
            "likes_count": 3205,
            "retweet_count": 498,
            "created_at": "04/30/2022, 17:51:54"
        },
        {
            "text": "@BlueStarOffers That's just how ignored so much of this stuff has been until now.",
            "likes_count": 217,
            "retweet_count": 4,
            "created_at": "04/28/2022, 23:10:16"
        },
        {
            "text": "@TheNamesQ Yup! You know as well as anyone!",
            "likes_count": 75,
            "retweet_count": 2,
            "created_at": "04/28/2022, 22:48:48"
        },
        {
            "text": "Amber Heard's team used a very short clip of audio from the bloody Australia incident. They want you to think it's just Johnny Depp angry, in order to paint a much different picture than what actually happened. Lots more to it in this old-ish video I made!\nhttps://t.co/YVvnKXRisQ",
            "likes_count": 2505,
            "retweet_count": 467,
            "created_at": "04/28/2022, 22:46:24"
        },
        {
            "text": "- This was a great week\n\n- Johnny Depp is a good man\n\n- Amber Heard is wrong\n\n(Haiku)",
            "likes_count": 5465,
            "retweet_count": 518,
            "created_at": "04/28/2022, 22:28:39"
        },
        {
            "text": "Amber Heard told Starling Jenkins (Security) the poop she left in Johnny Depp's bed was not the dogs but a \"horrible practical joke gone wrong\". She knew what she did and why she did it. The dog excuse wouldn't be cooked up until later.",
            "likes_count": 2601,
            "retweet_count": 442,
            "created_at": "04/28/2022, 21:10:03"
        },
        {
            "text": "Amber's lawyer: \"Mr. Depp had his penis out, correct?\"\n\nMalcolm: \"No! I believe I'd know if Mr. Depp had his penis out.\"\n\nAs I said ladies and gents...gold!\n\nThese are the questions Johnny Depp's witnesses have to field from Amber Heard's team.",
            "likes_count": 8834,
            "retweet_count": 954,
            "created_at": "04/28/2022, 20:45:47"
        },
        {
            "text": "Malcolm knows what he saw and heard! Testifying that Amber Heard chased Johnny Depp from the house in Australia after she cut his finger off. Screaming at him. Called him a coward. Mocked him again for leaving the situation. This after she claimed HE held HER hostage for 3 days!",
            "likes_count": 5387,
            "retweet_count": 788,
            "created_at": "04/28/2022, 20:37:24"
        }
    ]
}